system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version: 2412                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                     |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

// Which steps to run
castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    //---- nine turbine cylinders
    turbine1
    {
        type searchableCylinder;
        point1 (0 0 -0.75);
        point2 (0 0  0.75);
        radius 0.75;
    }
    turbine2
    {
        type searchableCylinder;
        point1 (2 0 -0.75);
        point2 (2 0  0.75);
        radius 0.75;
    }
    turbine3
    {
        type searchableCylinder;
        point1 (0 2 -0.75);
        point2 (0 2  0.75);
        radius 0.75;
    }
    turbine4
    {
        type searchableCylinder;
        point1 (2 2 -0.75);
        point2 (2 2  0.75);
        radius 0.75;
    }
    //turbine5
    //{
    //    type searchableCylinder;
    //    point1 (2 2 -0.75);
    //    point2 (2 2  0.75);
    //    radius 0.75;
    //}
    //turbine6
    //{
    //    type searchableCylinder;
    //    point1 (4 2 -0.75);
    //    point2 (4 2  0.75);
    //    radius 0.75;
    //}
    //turbine7
    //{
    //    type searchableCylinder;
    //    point1 (0 4 -0.75);
    //    point2 (0 4  0.75);
    //    radius 0.75;
    //}
    //turbine8
    //{
    //    type searchableCylinder;
    //    point1 (2 4 -0.75);
    //    point2 (2 4  0.75);
    //    radius 0.75;
    //}
    //turbine9
    //{
    //    type searchableCylinder;
    //    point1 (4 4 -0.75);
    //    point2 (4 4  0.75);
    //    radius 0.75;
    //}

    //---- overall refinement box for all turbines
    turb_zone
    {
        type searchableBox;
        min (-1.5 -1.5 -0.8);
        max (5.5  5.5  0.8);
    }
}

castellatedMeshControls
{
    maxLoadUnbalance      0.10;
    nCellsBetweenLevels   1;
    features              ();
    refinementSurfaces    {};
    resolveFeatureAngle   30;

    refinementRegions
    {
        turb_zone
        {
            mode   inside;
            levels ((1e15 1));
        }
    }

    locationInMesh               (2 2 0);
    allowFreeStandingZoneFaces   true;
    handleSnapProblems           false;
    useTopologicalSnapDetection  false;
}

snapControls
{
    nSmoothPatch            3;
    tolerance               2.0;
    nSolveIter              30;
    nRelaxIter              5;
    nFeatureSnapIter        10;
    implicitFeatureSnap     true;
    explicitFeatureSnap     true;
    multiRegionFeatureSnap  false;
    detectNearSurfacesSnap  false;
}

addLayersControls
{
    relativeSizes         true;
    layers                {};
    expansionRatio        1.0;
    finalLayerThickness   0.3;
    minThickness          0.25;
    nGrow                 0;
    featureAngle          60;
    nRelaxIter            5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals        3;
    nSmoothThickness      10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle    90;
    nBufferCellsNoExtrude 0;
    nLayerIter            50;
    nRelaxedIter          20;
}

meshQualityControls
{
    maxNonOrtho            65;
    maxBoundarySkewness    20;
    maxInternalSkewness    4;
    maxConcave             80;
    minVol                 1e-13;
    minTetQuality          1e-30;
    minArea                -1;
    minTwist               0.05;
    minDeterminant         0.001;
    minFaceWeight          0.05;
    minVolRatio            0.01;
    minTriangleTwist       -1;

    nSmoothScale      4;
    errorReduction    0.75;
    relaxed
    {
        maxNonOrtho 75;
    }
}

debug           0;
mergeTolerance  1e-6;
