0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $turbulentKE;

boundaryField
{

    outlet
    {
        type            inletOutlet;
        inletValue      uniform $turbulentKE;
        value           $internalField;
    }

    inlet
    {
        type            uniformFixedValue;
        uniformValue    constant $turbulentKE;
    }

    walls
    {
        type            kqRWallFunction;
        value           uniform 0.0;
    }

    top
    {
        type            kqRWallFunction;
        value           uniform 0.0;
    }

    bottom
    {
        type            kqRWallFunction;
        value           uniform 0.0;
    }

    "proc.*"
    {
        type            processor;
    }
}


// ************************************************************************* //
