system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

turbine1
{
    type crossFlowTurbineALSource;
    active on;

    crossFlowTurbineALSourceCoeffs
    {
        fieldNames (U);
        selectionMode cellSet;
        cellSet turbine1;
        origin (0 0 0);
        axis (0 0 1);
        rotorRadius 0.5;
        freeStreamVelocity (8 0 0);
        tipSpeedRatio 1.9;
        tsrAmplitude 0.19;
        tsrPhase 1.9;

        dynamicStall
        {
            active on;
            dynamicStallModel LeishmanBeddoesSGC;
            LeishmanBeddoesSGCCoeffs
            {
                Tp 1.7;
                Tf 3.0;
                TAlpha 6.25;
                alphaDS0DiffDeg 3.8;
                r0 0.01;
                Tv 11;
                Tvl 8.7;
                B1 0.5;
                eta 0.98;
                E0 0.16;
            }
        }

        flowCurvature
        {
            active on;
            flowCurvatureModel Goude;
        }

        blades
        {
            blade1
            {
                writePerf true;
                writeElementPerf true;
                nElements 14;
                endEffects on;
                elementProfiles (NACA0021);
                elementData
                (
                    (-0.5 0.5 0.0 0.14 0.5 0.0)
                    ( 0.5 0.5 0.0 0.14 0.5 0.0)
                );
            }
            blade2
            {
                $blade1;
                writePerf false;
                writeElementPerf false;
                azimuthalOffset 120.0;
            }
            blade3
            {
                $blade2;
                azimuthalOffset 240.0;
            }
        }

        struts
        {
            strut1
            {
                writePerf true;
                nElements 6;
                elementProfiles (NACA0021);
                elementData
                (
                    (0.0 0.05 0.0 0.14 0.3 0.0)
                    (0.0 0.5 0.0 0.14 0.3 0.0)
                );
            }
            strut2
            {
                $strut1;
                writePerf false;
                azimuthalOffset 120.0;
            }
            strut3
            {
                $strut2;
                azimuthalOffset 240.0;
            }
        }

        shaft
        {
            nElements 20;
            elementProfiles (cylinder);
            elementData
            (
                (-0.66 0.09)
                ( 0.66 0.09)
            );
        }

        profileData
        {
            NACA0021
            {
                tableType singleRe;
                Re 1.6e5;
                data
                (
                    #include "../../resources/foilData/NACA0021_1.6e5"
                );
            }
            cylinder
            {
                data ((-180 0 1.1)(180 0 1.1));
            }
        }
    }
}
//turbine2
//{
//    $turbine1;
//    cellZone turbine2;
//    origin (2 0 0);
//}
turbine2
{
    type crossFlowTurbineALSource;
    active on;

    crossFlowTurbineALSourceCoeffs
    {
        fieldNames (U);
        selectionMode cellSet;
        cellSet turbine1;
        origin (2 0 0);
        axis (0 0 1);
        rotorRadius 0.5;
        freeStreamVelocity (8 0 0);
        tipSpeedRatio 1.9;
        tsrAmplitude 0.19;
        tsrPhase 1.9;

        dynamicStall
        {
            active on;
            dynamicStallModel LeishmanBeddoesSGC;
            LeishmanBeddoesSGCCoeffs
            {
                Tp 1.7;
                Tf 3.0;
                TAlpha 6.25;
                alphaDS0DiffDeg 3.8;
                r0 0.01;
                Tv 11;
                Tvl 8.7;
                B1 0.5;
                eta 0.98;
                E0 0.16;
            }
        }

        flowCurvature
        {
            active on;
            flowCurvatureModel Goude;
        }

        blades
        {
            blade1
            {
                writePerf true;
                writeElementPerf true;
                nElements 14;
                endEffects on;
                elementProfiles (NACA0021);
                elementData
                (
                    (-0.5 0.5 0.0 0.14 0.5 0.0)
                    ( 0.5 0.5 0.0 0.14 0.5 0.0)
                );
            }
            blade2
            {
                $blade1;
                writePerf false;
                writeElementPerf false;
                azimuthalOffset 120.0;
            }
            blade3
            {
                $blade2;
                azimuthalOffset 240.0;
            }
        }

        struts
        {
            strut1
            {
                writePerf true;
                nElements 6;
                elementProfiles (NACA0021);
                elementData
                (
                    (0.0 0.05 0.0 0.14 0.3 0.0)
                    (0.0 0.5 0.0 0.14 0.3 0.0)
                );
            }
            strut2
            {
                $strut1;
                writePerf false;
                azimuthalOffset 120.0;
            }
            strut3
            {
                $strut2;
                azimuthalOffset 240.0;
            }
        }

        shaft
        {
            nElements 20;
            elementProfiles (cylinder);
            elementData
            (
                (-0.66 0.09)
                ( 0.66 0.09)
            );
        }

        profileData
        {
            NACA0021
            {
                tableType singleRe;
                Re 1.6e5;
                data
                (
                    #include "../../resources/foilData/NACA0021_1.6e5"
                );
            }
            cylinder
            {
                data ((-180 0 1.1)(180 0 1.1));
            }
        }
    }
}
//turbine3
//{
//    $turbine1;
//    cellZone turbine3;
//    origin (0 2 0);
//}
turbine3
{
    type crossFlowTurbineALSource;
    active on;

    crossFlowTurbineALSourceCoeffs
    {
        fieldNames (U);
        selectionMode cellSet;
        cellSet turbine1;
        origin (0 2 0);
        axis (0 0 1);
        rotorRadius 0.5;
        freeStreamVelocity (8 0 0);
        tipSpeedRatio 1.9;
        tsrAmplitude 0.19;
        tsrPhase 1.9;

        dynamicStall
        {
            active on;
            dynamicStallModel LeishmanBeddoesSGC;
            LeishmanBeddoesSGCCoeffs
            {
                Tp 1.7;
                Tf 3.0;
                TAlpha 6.25;
                alphaDS0DiffDeg 3.8;
                r0 0.01;
                Tv 11;
                Tvl 8.7;
                B1 0.5;
                eta 0.98;
                E0 0.16;
            }
        }

        flowCurvature
        {
            active on;
            flowCurvatureModel Goude;
        }

        blades
        {
            blade1
            {
                writePerf true;
                writeElementPerf true;
                nElements 14;
                endEffects on;
                elementProfiles (NACA0021);
                elementData
                (
                    (-0.5 0.5 0.0 0.14 0.5 0.0)
                    ( 0.5 0.5 0.0 0.14 0.5 0.0)
                );
            }
            blade2
            {
                $blade1;
                writePerf false;
                writeElementPerf false;
                azimuthalOffset 120.0;
            }
            blade3
            {
                $blade2;
                azimuthalOffset 240.0;
            }
        }

        struts
        {
            strut1
            {
                writePerf true;
                nElements 6;
                elementProfiles (NACA0021);
                elementData
                (
                    (0.0 0.05 0.0 0.14 0.3 0.0)
                    (0.0 0.5 0.0 0.14 0.3 0.0)
                );
            }
            strut2
            {
                $strut1;
                writePerf false;
                azimuthalOffset 120.0;
            }
            strut3
            {
                $strut2;
                azimuthalOffset 240.0;
            }
        }

        shaft
        {
            nElements 20;
            elementProfiles (cylinder);
            elementData
            (
                (-0.66 0.09)
                ( 0.66 0.09)
            );
        }

        profileData
        {
            NACA0021
            {
                tableType singleRe;
                Re 1.6e5;
                data
                (
                    #include "../../resources/foilData/NACA0021_1.6e5"
                );
            }
            cylinder
            {
                data ((-180 0 1.1)(180 0 1.1));
            }
        }
    }
}
//turbine4
//{
//    $turbine1;
//    cellZone turbine4;
//    origin (2 2 0);
//}
turbine4
{
    type crossFlowTurbineALSource;
    active on;

    crossFlowTurbineALSourceCoeffs
    {
        fieldNames (U);
        selectionMode cellSet;
        cellSet turbine1;
        origin (2 2 0);
        axis (0 0 1);
        rotorRadius 0.5;
        freeStreamVelocity (8 0 0);
        tipSpeedRatio 1.9;
        tsrAmplitude 0.19;
        tsrPhase 1.9;

        dynamicStall
        {
            active on;
            dynamicStallModel LeishmanBeddoesSGC;
            LeishmanBeddoesSGCCoeffs
            {
                Tp 1.7;
                Tf 3.0;
                TAlpha 6.25;
                alphaDS0DiffDeg 3.8;
                r0 0.01;
                Tv 11;
                Tvl 8.7;
                B1 0.5;
                eta 0.98;
                E0 0.16;
            }
        }

        flowCurvature
        {
            active on;
            flowCurvatureModel Goude;
        }

        blades
        {
            blade1
            {
                writePerf true;
                writeElementPerf true;
                nElements 14;
                endEffects on;
                elementProfiles (NACA0021);
                elementData
                (
                    (-0.5 0.5 0.0 0.14 0.5 0.0)
                    ( 0.5 0.5 0.0 0.14 0.5 0.0)
                );
            }
            blade2
            {
                $blade1;
                writePerf false;
                writeElementPerf false;
                azimuthalOffset 120.0;
            }
            blade3
            {
                $blade2;
                azimuthalOffset 240.0;
            }
        }

        struts
        {
            strut1
            {
                writePerf true;
                nElements 6;
                elementProfiles (NACA0021);
                elementData
                (
                    (0.0 0.05 0.0 0.14 0.3 0.0)
                    (0.0 0.5 0.0 0.14 0.3 0.0)
                );
            }
            strut2
            {
                $strut1;
                writePerf false;
                azimuthalOffset 120.0;
            }
            strut3
            {
                $strut2;
                azimuthalOffset 240.0;
            }
        }

        shaft
        {
            nElements 20;
            elementProfiles (cylinder);
            elementData
            (
                (-0.66 0.09)
                ( 0.66 0.09)
            );
        }

        profileData
        {
            NACA0021
            {
                tableType singleRe;
                Re 1.6e5;
                data
                (
                    #include "../../resources/foilData/NACA0021_1.6e5"
                );
            }
            cylinder
            {
                data ((-180 0 1.1)(180 0 1.1));
            }
        }
    }
}
// ************************************************************************* //
