system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    turbine1;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        sourceInfo
        {
            type cylinder;
            p1 (0 0 -0.625);
            p2 (0 0 0.625);
            radius 0.625;
        }
    }

    {
        name    turbine1;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set turbine1;
        }
    }

    {
        name    turbine2;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        sourceInfo
        {
            type cylinder;
            p1 (2 0 -0.625);
            p2 (2 0 0.625);
            radius 0.625;
        }
    }

    {
        name    turbine2;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set turbine2;
        }
    }

    {
        name    turbine3;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        sourceInfo
        {
            type cylinder;
            p1 (0 2 -0.625);
            p2 (0 2 0.625);
            radius 0.625;
        }
    }

    {
        name    turbine3;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set turbine3;
        }
    }

    {
        name    turbine4;
        type    cellSet;
        action  new;
        source  cylinderToCell;
        sourceInfo
        {
            type cylinder;
            p1 (2 2 -0.625);
            p2 (2 2 0.625);
            radius 0.625;
        }
    }

    //{
    //    name    turbine4;
    //    type    cellZoneSet;
    //    action  new;
    //    source  setToCellZone;
    //    sourceInfo
    //    {
    //        set turbine4;
    //    }
    //}
    //{
    //    name    turbine5;
    //    type    cellSet;
    //    action  new;
    //    source  cylinderToCell;
    //    sourceInfo
    //    {
    //        type cylinder;
    //        p1 (2 2 -0.625);
    //        p2 (2 2 0.625);
    //        radius 0.625;
    //    }
    //}

    //{
    //    name    turbine5;
    //    type    cellZoneSet;
    //    action  new;
    //    source  setToCellZone;
    //    sourceInfo
    //    {
    //        set turbine5;
    //    }
    //}
    //{
    //    name    turbine6;
    //    type    cellSet;
    //    action  new;
    //    source  cylinderToCell;
    //    sourceInfo
    //    {
    //        type cylinder;
    //        p1 (4 2 -0.625);
    //        p2 (4 2 0.625);
    //        radius 0.625;
    //    }
    //}

    //{
    //    name    turbine6;
    //    type    cellZoneSet;
    //    action  new;
    //    source  setToCellZone;
    //    sourceInfo
    //    {
    //        set turbine6;
    //    }
    //}
    //{
    //    name    turbine7;
    //    type    cellSet;
    //    action  new;
    //    source  cylinderToCell;
    //    sourceInfo
    //    {
    //        type cylinder;
    //        p1 (0 4 -0.625);
    //        p2 (0 4 0.625);
    //        radius 0.625;
    //    }
    //}

    //{
    //    name    turbine7;
    //    type    cellZoneSet;
    //    action  new;
    //    source  setToCellZone;
    //    sourceInfo
    //    {
    //        set turbine7;
    //    }
    //}
    //{
    //    name    turbine8;
    //    type    cellSet;
    //    action  new;
    //    source  cylinderToCell;
    //    sourceInfo
    //    {
    //        type cylinder;
    //        p1 (2 4 -0.625);
    //        p2 (2 4 0.625);
    //        radius 0.625;
    //    }
    //}

    //{
    //    name    turbine8;
    //    type    cellZoneSet;
    //    action  new;
    //    source  setToCellZone;
    //    sourceInfo
    //    {
    //        set turbine8;
    //    }
    //}
    //{
    //    name    turbine9;
    //    type    cellSet;
    //    action  new;
    //    source  cylinderToCell;
    //    sourceInfo
    //    {
    //        type cylinder;
    //        p1 (4 4 -0.625);
    //        p2 (4 4 0.625);
    //        radius 0.625;
    //    }
    //}

    //{
    //    name    turbine9;
    //    type    cellZoneSet;
    //    action  new;
    //    source  setToCellZone;
    //    sourceInfo
    //    {
    //        set turbine9;
    //    }
    //}
);

// ************************************************************************* //
